Revit 2027 API
BuiltInFailures.SketchFailures.CurveIntersectsSplitFace Property
 The highlighted line intersects the boundary of the face being split. To split a face at its border, use an open loop that ends on the boundary of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveIntersectsSplitFace { get; }
Public Shared ReadOnly Property CurveIntersectsSplitFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveIntersectsSplitFace {
	FailureDefinitionId^ get ();
}
static member CurveIntersectsSplitFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace